In [2]:
import pandas as pd

# part 1

## 시리즈

In [57]:
# series
dict_data = {'a' : 1, 'b' : 2, 'c' : 3}
sr = pd.Series(dict_data)
print(type(sr)) # sr의 자료형 출력
sr

<class 'pandas.core.series.Series'>

a    1
b    2
c    3
dtype: int64

In [61]:
sr[1:]

b    2
c    3
dtype: int64

## 데이터프레임

In [24]:
# dataframe
exam = {'이름' : ['서준', '우현', '인아'],
       '수학' : [90, 80, 70],
       '영어' : [85, 95, 100],
       '체육' : [100, 90, 90]}
df = pd.DataFrame(exam)
# '이름'열을 행 인덱스로 지정
df = df.set_index('이름')
df

    수학   영어   체육
이름
서준  90   85  100
우현  80   95   90
인아  70  100   90

In [16]:
df.loc['서준']

수학     90
영어     85
체육    100
Name: 서준, dtype: int64

In [21]:
df['과학'] = [30, 40, 50]
df

    수학   영어   체육  음악  과학
이름
서준  90   85  100   0  30
우현  80   95   90   0  40
인아  70  100   90   0  50

In [28]:
exam = {'이름' : ['서준', '우현', '인아'],
       '수학' : [90, 80, 70],
       '영어' : [85, 95, 100],
       '체육' : [100, 90, 90]}
df2 = pd.DataFrame(exam)
df2

   이름  수학   영어   체육
0  서준  90   85  100
1  우현  80   95   90
2  인아  70  100   90

In [31]:
df2.loc['행4'] = 50
df2

    이름  수학   영어   체육
0   서준  90   85  100
1   우현  80   95   90
2   인아  70  100   90
행4  50  50   50   50

In [33]:
df2.loc[0, ['수학', '영어']] = 80
df2

    이름  수학   영어   체육
0   서준  80   80  100
1   우현  80   95   90
2   인아  70  100   90
행4  50  50   50   50

In [37]:
df2.iloc[[0, 1], 2:] = 50
df2

    이름  수학   영어  체육
0   서준  80   50  50
1   우현  80   50  50
2   인아  70  100  90
행4  50  50   50  50

In [54]:
df2.loc[[2,'행4']]['이름']

2     인아
행4    50
Name: 이름, dtype: object

## 인덱스 활용